<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest go-ipfs release and creates a package</string>
	<key>Identifier</key>
	<string>com.github.natewalck.pkg.go-ipfs</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>go-ipfs</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4</string>
	<key>ParentRecipe</key>
	<string>com.github.natewalck.download.go-ipfs</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-pkgroot</string>
				<key>pkgdirs</key>
				<dict>
					<key>usr</key>
					<string>0755</string>
					<key>usr/local</key>
					<string>0755</string>
					<key>usr/local/bin</key>
					<string>0755</string>
					<key>Library</key>
					<string>0755</string>
					<key>Library/LaunchDaemons</key>
					<string>0755</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>FileMover</string>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/go-ipfs/ipfs</string>
				<key>target</key>
				<string>%pkgroot%/usr/local/bin/ipfs</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PlistEditor</string>
			<key>Comment</key>
			<string>Writes out launchd item to run ipfs</string>
			<key>Arguments</key>
			<dict>
				<key>output_plist_path</key>
				<string>%pkgroot%/Library/LaunchDaemons/ai.protocol.ipfs.plist</string>
				<key>plist_data</key>
				<dict>
					<key>Label</key>
					<string>ai.protocol.ipfs</string>
					<key>UserName</key>
					<string>ipfs</string>
					<key>EnvironmentVariables</key>
					<dict>
						<key>IPFS_PATH</key>
						<string>/var/ipfs/.ipfs</string>
					</dict>
					<key>ProgramArguments</key>
					<array>
						<string>/usr/local/bin/ipfs</string>
						<string>daemon</string>
					</array>
					<key>KeepAlive</key>
					<true/>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgname</key>
				<string>%NAME%-%version%</string>
				<key>pkg_request</key>
				<dict>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>id</key>
					<string>ai.protocol.ipfs</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>scripts</key>
					<string>Scripts</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>usr</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>0755</string>
						</dict>
						<dict>
							<key>path</key>
							<string>/Library/LaunchDaemons/ai.protocol.ipfs.plist</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
							<key>mode</key>
							<string>0644</string>
						</dict>
					</array>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<string>%RECIPE_CACHE_DIR%/%NAME%-pkgroot</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
