Description: Downloads latest Macadmins Python release and imports into Munki.
Identifier: com.github.natewalck.munki.MacadminsPython
ParentRecipe: com.github.jazzace.download.MacadminsPython
MinimumVersion: 2.3.0

Input:
  NAME: MacadminsPython
  MUNKI_REPO_SUBDIR: apps/MacadminsPython
  pkginfo:
    catalogs:
    - testing
    category: Configuration Management
    description: MacadminsPython is a relocatable distribution of Python for Mac Admins
    developer: Erik Gomez
    display_name: Mac Admins Python
    name: '%NAME%'
    unattended_install: true

Process:
- Processor: MunkiImporter
  Arguments:
    minimum_os_version: '11.0'
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
    version_comparison_key: CFBundleVersion
